Тестовая_база_ERP_14/src/Reports/РЭЙ_ВедомостьБанковскогоКонтроля/РЭЙ_ВедомостьБанковскогоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РЭЙ_ВедомостьБанковскогоКонтроля</name>
  <attributes>
    <name>ДатаОтчета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьРазделы456</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрактаВЭД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Report>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_КонтрактыВЭД/РЭЙ_КонтрактыВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_КонтрактыВЭД</name>
  <attributes>
    <name>Автопролонгация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РЭЙ_ВидыПодтверждающихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрактаВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыКонтрактовВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтартовойДатыОжидаемогоСрока</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыСтартовыхДатОжидаемогоСрока</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияОбязательствПоКонтракту</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставкиОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругиеМетодыОпределенияПроцентнойСтавки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инкотермс</name>
    <type>
      <types>CatalogRef.РЭЙ_Инкотермс</types>
    </type>
  </attributes>
  <attributes>
    <name>ИныеПлатежиПредусмотренныеКредитнымДоговором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПериодичностиФиксированныхПлатежей</name>
    <type>
      <types>EnumRef.РЭЙ_КодыПериодичностиФиксированныхПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДляВозвратаАвансаПоИмпортномуКонтракту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДополнительное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактБезСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактПредмет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактПредметАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактТоварный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйСиндикат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныеФинОрганизации</name>
    <type>
      <types>EnumRef.РЭЙ_МеждународныеФинОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоДнейДляУведомленияОПрекращенииДействияКонтракта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Многосторонний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеДействует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяОбъектомВалютногоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЗаполненияГрафикаПогашения</name>
    <comment>0 - Сведения из кредитного договора, 1 -  Оценочные данные</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежаПредоплаты</name>
    <type>
      <types>EnumRef.РЭЙ_ОтсрочкаПлатежаПредоплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаДопСоглашений</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодическиеФиксированныеПлатежи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодФиксированныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставлениеЗайма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПривлечениеКредитаЗайма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентныеПлатежиПоКредитамВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_ПроцентныеПлатежиПоКредитамВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрямоеИнвестирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПереходаРисков</name>
    <type>
      <types>CatalogRef.РЭЙ_ПунктыПереходаРисков</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПроцентнойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенияВалКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочныйКонтракт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправкиВКсНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокиПогашенияКредитовВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_СрокиПогашенияКредитовВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЛИБОР</name>
    <type>
      <types>EnumRef.РЭЙ_СтавкаЛИБОР</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалВыручкиПодлежащаяЗачислениюНаСчетаВБанкеНерезиденте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПодлежащаяЗачислениюНаСчетаВБанкеНерезиденте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтавкаГодовыхПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Экспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтороныПоКонтракту</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСоглашения</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемоеКоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемоеКоличествоДнейДополнительное</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Reports/РЭЙ_ВедомостьБанковскогоКонтроля/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДатуОтчета();
	Отчет.Организация = РЭЙ_Универсализация.ПолучитьОсновнуюОрганизацию();
	
	Отчет.НеПечататьРазделы456 = Истина;	
	
	Если ЗначениеЗаполнено(Отчет.КонтрактВЭД) Тогда
		СформироватьОтчетНаСервере();
	КонецЕсли;
	
	УстановитьПараметрыВыбора_КонтрактВЭД();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Если ПроверитьЗаполнение() Тогда
		Если Не ЗначениеЗаполнено(РЭЙ_СлужебныйСервер.ПолучитьЗначениеРеквизита(Отчет.КонтрактВЭД, "ПаспортСделки")) Тогда
			ПоказатьПредупреждение(, "Не удалось найти документ ""Заявление о постановке на учет контракта"" по выбранному контракту.");
			Возврат;
		КонецЕсли;
		СформироватьОтчетНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	ЗаполнитьДатуОтчета();
	
	Результат.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Если Отчет.ДатаОтчета >= Дата(2018,03,01) Тогда
		Результат.Вывести(ОтчетОбъект.СформироватьВБК_2018());
	Иначе
		Результат.Вывести(ОтчетОбъект.СформироватьВБК_2015());
	КонецЕсли;
	
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
	Отчет.ДатаОтчетаВручную = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОтобразитьСостояниеНесформированногоОтчета();
	Отчет.ДатаОтчетаВручную = Ложь;
	ЗаполнитьДатуОтчета();
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрактаВЭДПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
	УстановитьПараметрыВыбора_КонтрактВЭД();
	ЗаполнитьКонтрактВЭД();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
	УстановитьПараметрыВыбора_КонтрактВЭД();
	ЗаполнитьКонтрактВЭД();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
	УстановитьПараметрыВыбора_КонтрактВЭД();
	ЗаполнитьКонтрактВЭД();
КонецПроцедуры

&НаКлиенте
Процедура КонтрактВЭДПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
	КонтрактВЭДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрактВЭДПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Отчет.КонтрактВЭД) Тогда
		Отчет.Контрагент = Отчет.КонтрактВЭД.Контрагент;
		Отчет.Организация = Отчет.КонтрактВЭД.Организация;
		
		Если Отчет.КонтрактВЭД.КредитныйДоговор = Ложь Тогда
			Отчет.ВидКонтрактаВЭД = "Контракт";
		КонецЕсли; 
		Если Отчет.КонтрактВЭД.КредитныйДоговор Тогда
			Отчет.ВидКонтрактаВЭД = "Кредитный договор";
		КонецЕсли;
		
		УстановитьПараметрыВыбора_КонтрактВЭД();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Отображение

&НаСервере

Процедура УстановитьПараметрыВыбора_КонтрактВЭД()
	МассивПараметровВыбора = Новый Массив;
	
	Если ЗначениеЗаполнено(Отчет.ВидКонтрактаВЭД) Тогда
		Если Отчет.ВидКонтрактаВЭД = "Контракт" Тогда
			МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.КредитныйДоговор", Ложь));
		КонецЕсли;
		Если Отчет.ВидКонтрактаВЭД = "Кредитный договор" Тогда
			МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.КредитныйДоговор", Истина));
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КонтрактВЭД.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	СвязиПараметровВыбора = Новый Массив;
	
	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Отчет.Организация"));
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Контрагент) Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Отчет.Контрагент"));
	КонецЕсли;
	
	Элементы.КонтрактВЭД.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДатуОтчета()
	Если Не Отчет.ДатаОтчетаВручную Тогда
		Отчет.ДатаОтчета = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрактВЭД()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РЭЙ_КонтрактыВЭД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РЭЙ_КонтрактыВЭД КАК РЭЙ_КонтрактыВЭД
	|ГДЕ
	|	РЭЙ_КонтрактыВЭД.Контрагент = &Контрагент
	|	И РЭЙ_КонтрактыВЭД.Организация = &Организация
	|	И НЕ РЭЙ_КонтрактыВЭД.ПометкаУдаления
	|	И (&ВидКонтрактаВЭД = """"
	|			ИЛИ &ВидКонтрактаВЭД = ""Контракт""
	|				И РЭЙ_КонтрактыВЭД.КредитныйДоговор = ЛОЖЬ
	|			ИЛИ &ВидКонтрактаВЭД = ""Кредитный договор""
	|				И РЭЙ_КонтрактыВЭД.КредитныйДоговор = ИСТИНА)";

	Запрос.УстановитьПараметр("Контрагент", Отчет.Контрагент);
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Запрос.УстановитьПараметр("ВидКонтрактаВЭД", Отчет.ВидКонтрактаВЭД);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Отчет.КонтрактВЭД = Выборка.Ссылка;
		КонтрактВЭДПриИзмененииНаСервере();
	Иначе
		Отчет.КонтрактВЭД = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеНесформированногоОтчета()
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.Результат.ОтображениеСостояния.Видимость = Истина;
КонецПроцедуры

#КонецОбласти
